{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"41e80625-1460-5272-bbde-196ceb9a132f","html":"<p>Credit must be given where due!Apple, after a series of disappointments, impressed me quite a lot today.Let’s first talk about the disappointments:- The ‘phone app’ of my iPhone hangs! I think there’s no place where a company like Apple can hide for something as sloppy as this. A small sample survey that I did on this subject with people around me indicated that the problem is not isolated to my handset. (Apple - 0, LowestOrderSchmuck - 1)- A teammate lost a day’s worth of work when Sierra’s first update came out. The system crashed and nothing would bring it back other than a complete re-install of the OS. I’ve been forced to stay on El Capitan even after more than 6 months of the latest version being out. I don’t think I have the nerves or the motivation to land myself in muck voluntarily.Anyway, let’s put that negativity behind us and talk about the uber-cool migration tool that comes with apple by default - no third-party integration, no version mismatch issues, no spilling hot coffee on the vulnerable parts of your body - just the sheer joy of connect-click-migrate!Just connect your new machine to your old one (over a wired or wireless network), open the Migration-Assistant in both the machines and follow the onscreen instructions. It is as simple as that! The most natural, unadulterated joy I experienced on Apple after a lifetime of pain and disappointment. (In case you are wondering why I am on a Mac in the first place, well, sometimes we have to go down the dirty path for a living!)The whole process took under 40 minutes and for my mac:MacBook Pro (Retina, 15-inch, Mid 2015)2.2 GHz Intel Core i716 GB 1600 MHz DDR3Oh yeah, before we close, if you migrate from an old machine to a new one and don’t intend to use the old machine, always try:sudo rm -rf /(Watching things burn like that is like sitting in a huge room filled with bubble-wrap!)</p>","fields":{"tagSlugs":["/tags/mac/","/tags/macbook/","/tags/apple/","/tags/migration/","/tags/migrationassistant/"]},"frontmatter":{"title":"My First rm -rf /","tags":["mac","macbook","apple","migration","migrationassistant"],"date":"2017-02-06T07:42:14+05:30","description":null}}},"pageContext":{"slug":"/undefined/"}}