{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"d4a7fcc5-a42e-549a-a90d-ba42deded121","html":"<p>As much as all developers love Linux (and love Mac for the same reasons; things that Mac heavily borrows from BSD) there are several occasions when we are asked to justify our love. “Why should you use Linux and not Windows?” is mostly a question that has its origin in modern times, the era of IT services. \nI do not have the statistics with me (as yet) but my best guess is that most developers employed in IT services in India have Windows running on their machines. The PMs use Windows, the QC team uses Windows and Windows is thrust upon the developer, almost always without any alternative, for several reasons - ease of communication between the teams (myth), security (massive myth), etc.\nThis post is hopefully going to make more people adopt Linux based operating systems in the IT services industry (at least for developers). I’ve had the fortune to work in a product based start-up in my formative years as a developer (had a Linux box at college too because my old machine would just not run Windows!) and my current employers have been flexible enough to let my power-house of a system run on Linux power-fuel. Still, once in a while the question, “Why Linux?” is floated around. Here are the answers:\nDevelopment on Linux is easy I work with open-source technologies and using Linux makes harnessing the power of the whole ecosystem easy. For instance, I can install and experiment with Hadoop without the need to look for a virtual box to run it in, most articles that I find would be around Linux too!\nReduce your development timeWorking with Windows is frustrating, to say the least! The OS itself is slow and the utilities that it provides are just not enough for fast paced development. I’m sure someone who has been working on Windows for several years would be very fast/productive, no denying that but, if that same person moved to Linux the productivity would invariably increase. \nSecurity is not optional Linux is the most secure Operating System; it has always been. For anyone even remotely concerned about security (and everyone should be!) Linux should be a natural choice as a development platform.\nThe world is open-source; Open-source is a worldMost industry standards/technologies rely heavily on open-source. It is a smarter way to getting quality products with minimum investment. Being plugged in directly into this ecosystem negates the need for adapters and wrappers that a Windows user cannot live without. \nHelping a fellow developer is a normIn the open-source world, getting help is far more easier than in a closed system like Microsoft related technologies. The open-source culture is probably the first thing that encourages its use. I know that if I have a problem with a library that I’m using, I can connect with the developer who worked on it directly without having to raise a service ticket with a company and going through the horrors of explaining the issue to the support staff. You think a particular piece of code is a performance bottleneck? Shoot out a mail to the developer, email address is invariably in the comments on the code! If I’m on Linux too, it becomes easier for the person trying to help me.\nHacking a quick prototypeBefore you take on the task to write a 5000 line code to build RESTful web-services and deploy it to a web-server to show a prototype to the client, consider running a 10 line code on a node.js server (that you wrote yourself in under 5 minutes!)\n“Look Ma, no dll”Linux is transparent! If something breaks, you can dig down and find out why. For a developer there is nothing more liberating than the fact that she has control over not just the code she’s writing but also on the infrastructure she is running it on! There is no magic happening under the hoods, everything is a configuration file that you can tweak to your liking.\nThe missing power tools!Linux has some very powerful tools that are simply not there in Windows! The terminal is a blazing fast, nuclear fusion powered, Rocky Balboa style powerhouse! and it packs some very powerful utilities. From text processing, to working with the Linux internals it has everything you need and much much more. \nThe missing roads and burnt bridgesMicrosoft over the years has done very little to win back the developer community and the community has taken cognizance of that. Their insistence on IE (the worst browser of the world!), their continued effort to appear anti-open-source have all snowballed against them. Today, anyone worth their salt runs away from using Windows for any serious development. Some of the best web-servers of the world do not even run on Windows while IIS continues to be a scalability hazard. Powerful and standard tools like GIT are not available in Windows.\nThe realm of the cloudWith cloud computing transitioning from being a ‘buzz-word’ to a norm in the industry and, the entire cloud infrastructure running on Linux machines, Windows is eventually going to go away. At best, it would be limited to laptops that the management teams would use (which segment is again being threatened by Apple).\nReliability is king!Windows machines balk under pressure! As much as one tries to deny it, the blue screen of death is an inevitability for any Windows user. I don’t know about you but I would rather not lose my days effort to a blue screen of death right before I commit my code to an SVN server (The Flying Spaghetti Monster save you if the SVN server is running on Windows!)</p>","fields":{"tagSlugs":["/tags/linux/","/tags/open-source/","/tags/windows/","/tags/microsoft/"]},"frontmatter":{"title":"Why Do I Use Linux (and why you should too!)","tags":["linux","open source","windows","microsoft"],"date":"2014-11-03T03:00:58+05:30","description":null}}},"pageContext":{"slug":"/undefined/"}}