{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"105db317-4499-5212-a9b0-7d1f86ef8479","html":"<blockquote>\n<p>TL;DR; Writing on Tumblr is slow!</p>\n</blockquote>\n<p>I’ve been in love with the content I consume on Tumblr. I think it’s quirky, imaginative and delicious. Tumblr has been able to create a niche for itself in the several content areas and I would rather spend my time on Tumblr than say, Facebook (the dark underbelly of Tumblr is quite exciting as well!)</p>\n<p>That said, I don’t enjoy composing my posts on Tumblr. It is a slow and painful process, even when I use the markdown editor.</p>\n<h1>Here’s what I would have liked to have on Tumblr:</h1>\n<ul>\n<li>Auto save! I’ve lost some work once in a while because Tumblr does not save what you write automatically. Switching from <code class=\"language-text\">Post</code> mode to <code class=\"language-text\">Save</code> mode is just insane!</li>\n<li>The <em>Preview</em> is a lot of times very different from what I finally see on the browser.</li>\n<li>A better way to search my posts and organise them.</li>\n<li>Ability to create a collection of posts on a topic. Think of this as a “Series”. I don’t have a direct way of doing this on Jekyll either but, it is a lot faster to update multiple posts on my editor.</li>\n</ul>\n<h1>Things I love about Jekyll</h1>\n<ul>\n<li>I can use my own editor! Atom works very well with markdown templates and I know the shortcuts!</li>\n<li>I can preview on localhost. This is just incredible faster, especially when you are writing something that has a lot of different types of content - code blocks, etc.</li>\n<li>More creative control over the look and feel of my blog (although, this is just initial excitement. I’m yet to change anytime in this template I picked up from Github)</li>\n<li>Hosting at Github is wonderful! There might be some scale issues but hey, this is not a mission critical application!</li>\n</ul>","fields":{"tagSlugs":["/tags/tumblr/","/tags/jekyll/"]},"frontmatter":{"title":"Why I moved to Jekyll (OR Why I dislike Tumblr)","tags":["tumblr","jekyll"],"date":"2018-04-09T23:41:30+05:30","description":null}}},"pageContext":{"slug":"/posts/why-i-moved-to-jekyll-or-dislike-tumblr"}}