{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"c792db92-aa75-5b24-9299-0250fa9eec22","html":"<p>The world is always on the look-out for ’lazy signup forms’. When I was working on a small product of my own last year and wanted everything to be perfect (one of the reasons why I could never ship it!) I remember spending a great deal of my time trying to figure out the best way to get the maximum information without annoying the user.If one is not the Facebook/Twitter of the world, people have the least amount of patience while signing up for a new service/product. One of the best ways to go about it is to stand on the shoulders of the giants and go with OAuth, letting them worry about information security while giving your users ‘one-touch-signup’. As it turns out, life is not always very simple. There are reasons why this may not be feasible for your product (maybe you are building another Facebook?!)Anyways, cutting the long story short, the reason why I’m jumping up and down and going crazy and sitting down to write this post (while I have a few Pig scripts to complete before this lousy Monday ends) is because I found what I feel is one of the best solution to the signup problem!Slack, has been a joy to use so far. With just this 2 field form I was able to signup (which is not uncommon these days)The friendly slackbot has been chatting me up and guiding me through things that are already quite intuitive. And, today it happened! The moment of extreme joy that brought tears of joy to my dark-circled, sleep deprived, over worked eyes. Lo-and-behold:After 4 days of using Slack, I get a ping from slackbot that walked me through giving details about my account that would make my profile more complete. No ugly form, no ugly “your profile is 40% complete” and most importantly, no long signup form. The experience was interactive and a joy to work.Of course this might not be possible for all products but, I’m sure that something similar would be part of the next thing that I start working on!</p>","fields":{"tagSlugs":["/tags/slack/","/tags/lazy-registration/","/tags/signup/","/tags/form/","/tags/ux/"]},"frontmatter":{"title":"User Registration Problem Is Solved!","tags":["slack","lazy-registration","signup","form","ux"],"date":"2015-02-16T07:29:44+05:30","description":null}}},"pageContext":{"slug":"/posts/user-registration-problem-is-solved"}}