{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"snortingcode","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"af9126ef-91aa-52a6-8a47-5a4e055aff37","html":"<p>[You can expect me to write a lot more about productivity in the following months as I prepare fellow teammates to have long streaks of productive runs!]Everyone can use some extra time each day! Let’s jump right in:Time your shower. Also, limit the time you take to decide what to wear for the day. On an average, people might spend between 30 minutes to 1 hour on this daily activity. Reduce it to under 10 minutes.Time saved: 15 Minutes!Replace music with earplugs. We listen to music, while working, to drown out the noise. This might not seem like a distraction since we are so used to it, but in the end you’ll end up taking more time to do every task. Buy some good quality earplugs and create a 25/5 minutes rule - work with earplugs for 25 minutes, then take a music and water break for 5 minutes (also, walk around to get those steps!). You will find your productivity increase (you’ll enjoy music better too!) Calibrate your time saved but, my experience is that your productivity would go up by at least 20% -> for an 8-10 hour work day, you should be able to save about 2 hours!Time saved: 2 hours!Eat with a (very) small set of people. Eating time is meant for eating. Eating alone can be difficult for a few people but, ensure that you avoid big groups while going for lunch/dinner. Bigger groups at the lunch table result in less time spent on eating and more spent on banter. This is REALLY BAD for your health as well! When we chit-chat while eating, we are more likely to over/under eat and in general, not enjoy our food a lot.If a discussion is happening over lunch, ensure that the discussion starts and ends before everyone begins to eat (remember to not start the discussion before the order is placed!). If you eat 3 meals a day, you can save an average of 15 minutes per meal.Time saved: 45 minutes!Shut-down at least an hour before your sleep time. This might sound counter-intuitive but, we waste a lot of time sleeping because we don’t have regular sleeping times. When you shut-down an hour before sleeping and engage in things like meditation or take a cold shower and prepare for bed, you can easily reduce the twisting-turning time that spills over to the low productivity levels early in the morning. This alone can add several minutes (even hours!) to your day so I won’t count this in.Time saved: A LOT!Have distraction-free family time. We do the things we do for our loved ones! Quality family time is not just about the time spent together. If we are not really with them, when we are together, we would be forced to sit through a crappy movie, forced to respond to WhatsApp texts while we are at work and forced to do several other things that never actually feel like we’ve spent time together at all. A good, engaging discussion after finishing dinner is far better than time spent together watching NEWS! Do this and you’d see not just having more time on your hands but a much deeper connect with people you love! I won’t time this one either because family deserves all the time after all!Remember, no phones, no TV, no work calls, no other distractions when you are with other people - they deserve your time!Time saved: A LOT!Switch off the Television; throw it out of your house. After Vietnam’s disasters, one general of the US army commented - “We should’ve just given them free Television sets!” If there’s one mode of misery that connects all of humanity today, it is the tele! Television doesn’t just make you dumb every minute you spend time on it, it actually sets you up for all sorts of nasty social disasters as well. Let things of importance come to you! A neurotic tweet by a deranged person is not worth your time! A prime-time discussion about that tweet might sound like “intellectual orgasm” but, it is absolute garbage! Switch off the TV and you easily save several hours a day!Time saved: 1 hour (or 5 if you like to keep yourself really “informed”)!There you go! These are not difficult things to do and they certainly don’t turn you into a robot! If anything, these would improve the quality of your personal and social life!</p>","fields":{"tagSlugs":["/tags/productivity/","/tags/worklife/","/tags/work-life-balance/","/tags/work-life/","/tags/lifestyle/","/tags/balance/","/tags/time/"]},"frontmatter":{"title":"How to gain > 4 extra hours everyday!","tags":["productivity","worklife","work life balance","work life","lifestyle","balance","time"],"date":"2018-02-15T22:56:39+05:30","description":null}}},"pageContext":{"slug":"/posts/how-to-gain-4-extra-hours-everyday"}}