{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"5c298e24-cca2-588f-b1c6-f04815b547a2","html":"<p>Learning is such an innate quality, a natural skill, that each one of us knows how to learn about the world around us. Kids are engineered to absorb the knowledge about the world around them. They do it so innately that we’ve spent billions of dollars in trying to understand how they are capable of such a feat, in neuroscience labs and are only beginning to scratch the surface of that mystery.</p>\n<p>Yet, driven by our arrogance, us grownups have, for centuries, believed that we have “lessons” to impart to kids. That our “methodology”, “pedagogy” is one that would work for generations of kids in teaching them things about the world.</p>\n<p>This arrogance is incapable of teaching anything! In fact, in most cases this is so caustic that it manages to motivate children to stop learning. These authority institutions that we encounter in the early years of our kids switch-off the natural ability of human beings to learn about their environment!</p>\n<h1>What do we teach in schools?</h1>\n<p>Let’s start with busting some myths about the “important subjects” - languages and mathematics. The truth is that kids have an innate language ability. We don’t need to teach them language. In fact, they are the ones who “invent” new languages. The ability to associate arbitrary written symbols to spoken words does need to be taught. The fact that most teachers involved in teaching language to young kids are oblivious of the innate language ability of kids, says a lot about how terrible the state of affairs are in that department. These teachers mistake arbitrary words and phrase constructions for the word of God. This is what the kids run into when they enter a school - grammar nazis! Things couldn’t be worse! Since access to important information is often restricted by the ability to acquire reading and writing skills, these teachers, at an early stage, do something that shuts the doors of learning for most kids since they themselves have been living under a rock! (If this seems like incorrect information, I would encourage you to do some research on language acquisition. Steven Pinker’s “The Language Instinct” is a great resource, there are a ton of videos on YouTube as well.)</p>\n<p>Mathematics, several people believe, is in our brain, just like language. The way it is taught is not just bad but often, incorrect! Memorising multiplication tables, memorising arbitrary formulae and rules to transform them into one another, memorising “concepts” without an explanation of the underlying theme. Mathematics is a language that is used to model the world. Newton invented calculus when he was trying to model gravity and not just as an abstract set of formulae and rules. Learning math is more about learning about the world around us than we usually think. There is more math to be learned in a playground than in a class with an unmotivated teacher which is usually the case in most schools. There is some interesting research that is discovering the use of musical training to help in imagining advanced concepts like topology. Sadly, that pedagogy lives only in fringes.</p>\n<p>The only things we are successful in teaching most kids in a school setting is discipline! How to respect authority, especially an irrational, unjust authority! In fact, most teachers I have spoken to think that this is an essential skill to have. Discipline, they feel is what keeps the world running. This fascination for order and control is fast fading. There is less and less trust in authoritative agencies of the world and things would only move towards more freedom.</p>\n<h1>What might be the solution?</h1>\n<p>Well, this is a blogpost! Don’t expect this to include a well-designed, flawless framework of this new system of education (or the wonders of the absence of it). That said, I can provide a way to imagine what such a system could be like. These days, when I’m given the responsibility to mentor a team member, the first question I ask is their preferred mode of learning. When I joined the IT industry, if you wanted to learn a new technology, you bought a book! These days, there are several amazing resources that do not come in the form of a physical book. Increasingly, I’ve come across young people who prefer a video lecture over reading a book. Several complex concepts become very easy to comprehend when a visualisation is used as an aid. The education industry is disrupting, with such innovative solutions becoming a part of our reality. Innovative learning that works at a fraction of the cost of the traditional education.</p>\n<p>Peer learning online communities are another great example of how the landscape is changing faster than can be imagined within the framework of the traditional education system. In effect, there needs to be an open sharing of research fuelled by community created content that makes that research available to people at large.</p>","fields":{"tagSlugs":["/tags/schools/","/tags/learning/","/tags/authority/","/tags/humanity/"]},"frontmatter":{"title":"If You Wish To Save Humanity, Shut Down All Schools!","tags":["schools","learning","authority","humanity"],"date":"2018-05-19T03:41:30+05:30","description":null}}},"pageContext":{"slug":"/undefined/"}}