{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"snortingcode","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"11c18258-86c9-548e-a9ef-b6c350cba580","html":"<p>Let me begin with a disclaimer: I’ve bet my career on Technology so, what I have to say about it is certainly influenced by a confirmation bias.I came across a Facebook post by a friend, that talked about a Robot Chef - one can download recipes over the Internet and, have this giant pair of robotic arms prepare food for them. Seeing it in motion was a delight for me, others did not share the same feeling. There were essentially 2 common themes in the concerns expressed in the comment section:This is going to kill the employment that my “maid” currently has - cooking meals for me and my family (Low skilled labor in India is very cheap so the richer people often have maids. Yes, this is India’s post-colonial irony!).\nThis would suck the joy out of a creative activity.</p>\n<p>You could apply similar arguments to any domain where automation is taking baby steps. Let’s talk about them one at a time.Employment in the age of automationYes, irrespective of what your friendly, neighbourhood entrepreneur tells you, automation IS eating into the employment scene. There are going to be fewer jobs around and currently held skill sets would become redundantly undesirable, irrelevant. This is already happening in areas where automation has gone beyond the “baby steps”, although, this is nothing new!There are 2 solutions that come to my mind (killing new technology is not a solution and, it would require nothing short of a world war followed by a frozen nuclear winter to do that - I don’t recommend doing that although your favourite world leader might urge you to support that idea):Explore and create new skill sets: Remember that “maid” that you are concerned about? Start investing in their future, urge them to take up evening classes to learn whatever they are capable of learning - soft skills, a new language (English in India is a sought after skill), elementary coding skills if they have some basic education.Make sure that you are paying them enough so that they can create “post-retirement” means of living for themselves. Help them with investments and future planning.</p>\n<p>Urge your governments to increase spending on things that matter -> health and education: If you live in a country where education and healthcare is not a fundamental right of every citizen, there’s something broken about your country! Vote to repair that scheme of things. A minimum basic income scheme is also something that governments should start to explore actively!</p>\n<p>Technology = End of creativityAsk any techie you know and they would tell you otherwise! But, I blame the tech world for this misconception. People think that technology is not a creative endeavour, possibly because tech sits on top of some ivory tower which reduces their customers to a UUID.randomUUID(). The tech world has largely failed to educate their users about the technology they use on a regular basis. We don’t have to be in this ignorant state! The technology we create doesn’t need to be “dumbed down” but, we need to stop thinking of our users as “dumb users” (I’ve heard that phrase a number of times in UX design discussions).For the non-techies reading this article, well, just because we use tools that most of you don’t have much experience with, does not really make us less creative. Imagine telling a violinist that they are not in a creative profession because true creativity is just vocalisation of ragas! In fact, the artists producing electronic sounds are facing similar questions around their work. (Don’t) watch this video that trivialises Alt-j’s music and you’ll understand my point better (they have over 8 million views!) I’m certain they won’t say the same thing about a vocalist!.This is insane! If you think that technology is not a creative activity/profession, try surrounding yourself with all the failed tech products that you can think of, for a day, here’s a list you can begin with: Windows 7, Orkut, Windows Vista, Zune (not many companies have the money to market failed products hence that list is heavy with Microsoft). In fact, creativity is the litmus test for a tech product! When we hire employees to build the next generation technology, we prefer people who can exhibit creative thinking ahead of any other skill that they might posses. The reason for that is simple, we don’t want to copy existing products, we want to build things that don’t exist yet. Imagining such products is impossible without creativity! Yes, the robotic companies are “just copying” basic human capabilities but, with that reductionist argument, Da Vinci was just copying some woman sitting on a chair!Final wordIf there’s one thing I want to convince you with this article, it is this: Whichever side of the fence you are on in this technology debate, you need to know what’s going on on the other side! If you are creating technology, you need to be able to effectively address these fears that your future customers might have.If you are a user (and you are! There’s no escape, the matrix has you :D ), engage with technology the way you engage with your local politician. If you think that things are broken, educate yourself enough to be able to dig out email IDs of people who make these tech products and write to them! They owe you an explanation!</p>","fields":{"tagSlugs":["/tags/technology/","/tags/automation/","/tags/robots/","/tags/robot-chef/","/tags/unemployment/"]},"frontmatter":{"title":"Let’s Settle The Technology Debate?!","tags":["technology","automation","robots","robot chef","unemployment"],"date":"2018-03-23T06:20:58+05:30","description":null}}},"pageContext":{"slug":"/posts/lets-settle-the-technology-debate"}}