{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"snortingcode","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"6fb11344-d9de-50eb-8772-3092ec1070ec","html":"<blockquote>\n<p>“I will not remove any objectionable material from any of my online <strong>properties</strong>!”</p>\n</blockquote>\n<p>The above statement came from a right-wing, online community admin of a <em>so-called</em> gay activist a few weeks ago. The context was Section 370 and the <em>material</em> in question was an offensive post that attempted to nullify the opinion of the people of Kashmir in the matter.</p>\n<p>Let’s wind the clock to a time before the 2014 general elections in India - the country was <em>going online</em> faster than ever, WhatsApp and Facebook were beginning to capture the imagination of people at large. WhatsApp groups, Facebook pages were promising to be the paneccea of community building. This was a time before <em>there was an app for everything</em> which meant that WA/Facebook groups were being used in very imaginative ways - there were groups that let you find accommodation in a new city, groups that let you sell old stuff (olx style), groups that enabled political discussions.</p>\n<p>I, like several people I know, got invited to a few of these groups. These groups were nothing more than a new avatar of the earlier <strong>Online Forums</strong> (remember the PHP powered forums of the good old days?) and the vagueness of their structure demanded a set of <strong>rules</strong> that the communities had to follow. Because of the undemocratic nature of Facebook/WA, these were almost always top-down protocols that were deviced by the creators/admins of the group which everyone in the group had to abide by. I remember a few feuds that questioned a few of these rules but, I forget the ways in which they were resolved.</p>\n<p><img src=\"/static/admin-meme.jpeg\" alt=\"A meme on Facebook/WhatsApp admin. Shows a man sitting at a desk. The caption reads: I will admin the shit out of you.\" title=\"You Got The Admin Power Babe!\"></p>\n<p>At the same time, encouraged by the disenfranchising DNA of these groups, we saw the emergence of, what we can call, the <strong>Admin Meme</strong>! These were memes that glorified (or attacked, often in jest) the group admins. For those of us who administered a few of these groups, the message was clear - we had a certain power over a group of people who had willingly submitted to the hierarchy established by these platforms. Along with a few others, I was the admin of a <em>Queer Confessions</em> group and I realized that it was no longer necessary for me to be funny, witty or even make any sense at all - my posts would be appreciated by a majority since they carried the extra weight of this fiat authority.</p>\n<p><a href=\"https://www.opendemocracy.net/en/democraciaabierta/leaked-documents-show-brazil-bolsonaro-has-grave-plans-for-amazon-rainforest/\">A lot</a> <a href=\"https://www.theguardian.com/us-news/2019/aug/19/why-does-donald-trump-want-to-buy-greenland\">has</a> <a href=\"https://scroll.in/article/721065/from-loving-his-german-shepherd-to-2ab-did-prime-minister-modi-really-say-that\">changed</a> since 2014! We live in a different world, a world that is on the brink of destruction! In this new era public opinion is manufactured in content farms, fake news seems more legit than <a href=\"https://www.youtube.com/watch?v=MJ6z26yPBV4\">news from traditional media</a> and <a href=\"https://www.youtube.com/watch?v=pnoLAMHwf2I\">people don’t seem to care</a>!</p>\n<p>In this <em>new age</em> (<strong>coughs</strong>) your membership to these online communities is bought and sold in the information/data market! Here’s how this works:</p>\n<h2>Step 1:</h2>\n<p>Create a <em>seemingly benign</em> community on WA/FB. Let’s call it <em>“Sexy women of Bollywood”</em></p>\n<h2>Step 2:</h2>\n<p>Add people to the group indiscriminately. (If you are in countries like India where privacy laws are virtually non-existant, you could spam as many people as you like and add them to these groups without taking their consent first! In other places like the USA the <strong>CAN SPAM</strong> act allows you to <em>spam everyone atleast once</em>!)</p>\n<h2>Step 3:</h2>\n<p>Keep sharing content that numbs the brain and encourages more mindless participation from unsuspecting members.</p>\n<h2>Step 4:</h2>\n<p>Wait for the right bidder to <strong><em>sell</em></strong> this *<strong>*PROPERTY**</strong> to for the highest price!</p>\n<p>After the community is <em>sold</em>, the more seasoned manipulators take over and quickly turn it into a toxic sludge of hateful propaganda! Often the bots overwhelm the communities and play on <a href=\"https://en.wikipedia.org/wiki/Groupthink\"><strong>group think</strong></a> to make people believe in ridiculous BS!</p>\n<h1>How does one escape this muck?</h1>\n<p>Well, the answer might not surprise you, just <strong>fucking</strong> quit Facebook, severely limit WhatsApp and adop more democratic, <a href=\"https://prasoonj.github.io/snortingcode/posts/open-source-alternatives-for-everyone/\">open source alternatives</a>! </p>","fields":{"tagSlugs":["/tags/community/","/tags/facebook/","/tags/india/"]},"frontmatter":{"title":"I Am The Admin Here (You are my bit*h!)","tags":["community","facebook","india"],"date":"2019-08-23T09:46:37.121Z","description":"Your Facebook/WhatsApp group admin wants to sell you in the market! How long can you feign ignorance?"}}},"pageContext":{"slug":"/posts/online-communities-as-property/"}}