{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"snortingcode","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"c9462062-aa46-5ecc-8e1f-411d94723ba9","html":"<p>PM Modi recently made a statement that his values don’t change. Since he is seen as a symbol of strength in the Indian political system, this statement is also perceived as one that symbolises the unshakable strength that people think is a prime requirement for the job.</p>\n<p>What do you think about unflinching value systems? Are you a weak person if your value system underwent a repair? I vaguely remember a similar conversation with a friend who was asking me about my value system a few months ago and was not quite convinced when I told him that I don’t have a rigid set of values. An explanation is due!</p>\n<p>Since we understand things better by analogy, I would start with a few of those and then talk about some concrete way to look at the situation.</p>\n<p>Ido Portal, the genius behind the movement culture, talks about the importance of building, what he calls, ‘bamboo legs’. His idea of strong legs is not the ones we see on the tele, lifting the equivalent of the indian parliament for squats, shaped like the trunk of an oak tree. Strength, he says, is about being able to be flexible. Flexible, bamboo like legs can perform much better under pressure. Flexibility seems to be a key element of physical strength.</p>\n<p>If we talk about the mind, one of the primary drivers for us is the need to be able to understand new surroundings and environments, as quickly as possible. The best brains belong to those who can change their perception of reality rapidly as new information flows in. That’s the central idea of Bayesian statistics - how does your understanding about reality improve when new information is provided to you. Our brains are bayesian networks, as far as we know. Taking pride in not being able to change your primary drivers, your value system, when new information is provided, might act as a great political move but, is very poor strategy to live ones life.</p>\n<p>One of the best philosophies for the question - “How should I live my life?” - comes from stoicism. I say it comes from stoicism because it is a somewhat formal treatment of the matter and several religions have adopted similar strategies. The analogy there is that you need to nurture your value systems, ethical standpoint with your understanding of ‘physics’ (understanding of the nature). As you discover new facts about the world, your ethical framework would adapt to this new understanding of reality. Life, therefore, has to be a constant process of improvement that this feedback enables.</p>\n<p>Now, our interaction with the world is largely dependent on the frameworks we use to interpret it. If your framework happens to be a religious one, you might tackle a question like “why does meditation feel so good” based on religious texts, anecdotes, traditions and rituals. If your framework of analysis is neuroscience, you might talk about how meditation decreases activity in the default mode network of our brain. While both these people would agree on the end goal, their explanation would differ in a grand manner. “Who is right?”, the question is absurd till we find a common language to talk about them. It is important, then, to find common grounds to be able to talk about a phenomenon that these different sets of people have observed even if they disagree in their explanation. This common ground - an isomorphism between the two systems - provides the grand unification of the two systems. </p>\n<p>I believe that strength comes from being ‘smart’. Our brain is our biggest asset. We clearly are not as strong as even our pets at home. Especially in political debates, when one talks about strength, they are talking about mental strength (although sharing pictures of Yoga or martial art practice sessions as a symbol of strength is becoming a norm these days). Mental strength is less about being a stubborn person who would never learn new information and more about building clever bridges across different value systems so that reality can be perceived in different perspectives.</p>\n<p>For PM Modi, this might mean developing the child like ability to be honest about his failures, humble about his victories and a deep sense of curiosity for things that may lie outside of the ethos of the sangh.</p>","fields":{"tagSlugs":["/tags/politics/","/tags/learning/","/tags/authority/","/tags/value-system/"]},"frontmatter":{"title":"PM Modi won’t change his values, should you?","tags":["politics","learning","authority","value system"],"date":"2018-08-13T03:41:30+05:30","description":null}}},"pageContext":{"slug":"/posts/modi-value-system"}}