{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"snortingcode","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"fc57d00f-e17a-50a9-b182-93210fb7e714","html":"<p>Elections in India started a couple of weeks ago. Elections on the other side of the world are not so far away. Over the years, despite the insistence on the superiority of its ancient cultural heritage, India has caulously tried to mimic USA. India’s financial systems, public survelance misadventures, corporate monopoly tactics, cultural and socio-economic policies have increasingly walked the line dictated by direct economic influence and a well oiled propaganda machinary that has been increasing its efficacy in consent manufacturing over the years.</p>\n<p>Election of Modi in India was celebrated by Trump supporters in USA in 2014 and when Trump managed to stunn the world by winning the presidential race in the US, his victory horns were heard in the saffron streets of Indian cities.</p>\n<blockquote>\n<p>Both these election results were clear about one thing - people wanted a radical change in the world affairs! </p>\n</blockquote>\n<h2>What changed post Modi/Trump?</h2>\n<p>There’s no denying that the world has changed drastically in the last few years, post those dramatic election results, for better or worse! Yet, the election messaging has remained the same. There has been a flood of battle tested campaign strategies delivering modified slogals that appear to be infusing the same drug into the election fervor under a different name. In India, for instance, the opposition is still the only impediment that the incumbant government pins all miseries of the population on; at times even digging out people like Nehru from the grave, carving monsters of convienience out of the defenseless dead.</p>\n<p>It’s quite possible that the leaders are as clueless about the sources and solutions of the problems that plague their countries, as the people who elected them. It would be unwise of anyone to suggest that they carry evil intentions and even if they do, Socratic wisdom reminds us that after all, <strong><em>ignorance is the source of all evil</em></strong>!</p>\n<p>The good news is that on the surface, both these states still look largely democratic. There are systemic disenfranchisement issues for several sections of the society but, the elections, on the whole, are not openly rigged. People still have the power, even if all it amounts to is certifying the con man who manged to fool them the best with their valuable vote. The fact that political setups need to spend money and effort in public propaganda is a sign of a functioning democracy.</p>\n<blockquote>\n<p>The seemingly infallible leaders may look like the protagonists or the antagonists of the political tales but, the story teller is still YOU, the average voter!</p>\n</blockquote>\n<p>When, how and where we go from here is in your hands. Yogendra Yadav, a respected political analyist and a fairly recent political leader from India, recently talked about how this election would decide ”<em>if India would remain India or not</em>”. Those are strong words if one introspects.</p>\n<p>People want change, that much is certain. What would that change look like? Who is capable of understanding the necessicity of that change? Who has the ability to deliver it? There are several questions that India and USA would attempt answer in the coming months. I have observed that more often than not, change is inevitable and it comes unannounced and uninvited. The peddlers of change are often just selling us status quo disguised as change!</p>\n<p>A recent example would be the Obama administration which did not change the economic exploitation by the rich, did not change the status of US funded war in several parts of the world, did not change the shameful bullying of the copyright lobby. A more extreme example would be Hitler himself who tried to take the world several years behind in terms of inclusiveness, tolerance and peace. The ones who sell dreams of a perfect future are often trapped in an imaginary reverie of the past. The pragmatic always prepare for an unseen future!</p>\n<p>The case of Modi in India is yet another example of status quo masquarading as socio-political change: the corruption is the same, economy is in slumber, education in shambles. There is a lot of talk about the future with a promise that it would look exactly like the “glorious past”. </p>\n<p>Such salespersons happen to have it easy since their audience is as afraid of change as they are! Their supporters stay immobile, captivated by the hypnotic chanting in their mind, that shuts down all discourse of a future that ought to look considerably different from what their current frame of reference would allow. </p>\n<p>So, what would India vote for? A future full of beautiful uncertainities or a cry for a faded glory? If one employs a modicum of thought to the idea of a “glorious past”, one would easily arrive at a fairly honest picture of what that glory looked like and who did it belong to. The past is paved with individual glories, enourmous monuments constructed on the bloodied backs of a repressed class, caste based discrimination. This idea of glory and past appeals to those who continue to hold on to power that would be diluted if more democratic leaders replace those who wish to dismantle the power of the will of the people. You, as the story teller, would eventually decide the future. You could break the chains of the past or continue to romanticise a leadership that wishes to plung the country into a backward direction, entertaining you with dreams of a future that it is incapable of delivering!</p>","fields":{"tagSlugs":["/tags/elections/","/tags/governance/","/tags/india/"]},"frontmatter":{"title":"Rediscovering India","tags":["elections","governance","india"],"date":"2019-04-22T17:46:37.121Z","description":"Did you know that there are great Open Source alternatives for almost every service you use on the Internet? Should you be using them?"}}},"pageContext":{"slug":"/posts/rediscovering-india/"}}