{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"97fb95c5-bbe6-586c-9c33-ffbc50a9046c","html":"<p>Let’s talk a little about leadership. Everyone hopes for a good\nleader to guide them in their formative years and aspires to be a worthy\none themselves when the time is right. There could be several\ndefinitions of ‘worthy’ - be in a position to be able to provide help to\npeople around, assume a position of unquestionable power, be immortal in some sense of the world - so we will skip talking about it.I\nhave a few of my own ideas on this subject - most of them validated by\nmy personal experiences, some validated by a strong conviction to agree\nwith my own thought process that suggests that these HAVE TO BE TRUE (if\nmy cognitive bias is blurring my thoughts please do write to me).This is what I think a good leader should try to do:Provide vision and general direction and then let the team take an organic path depending on the team dynamics.\nThe initial few interactions are a time for everyone in the team to\nunderstand the others and form the initial set of expectations from one\nanother. Even in a group where everyone knows everyone else, embarking\nupon a new project can always expose new areas of interests and\nconflicts. It is important for the team to cope with diversity of\nthoughts, ideas and people and a good leader enunciates the benefits of\nthis ‘self-discovery’ of the team dynamics by each of the team members. A team that shares a pizza is bound to have lesser communication barriers when they work together.Define policies and processes based on the dynamics that surface due to the interaction between team members.\nInstead of forcing a structure of rules and processes on the team, try\nto learn from the way the team interactions take shape and don’t shy\naway from making drastic changes to processes that have in fact worked\nfor you in the past. Think of your team as a graph with each node\nattached to every other node through a unique relationship - for a team\nof 10 people that would be (10*9)/2 = 45. Each of these relationships\nadd an idiosyncrasy to the team composition and dynamics. Each team is\ndifferent from every other team and what works for one would not work\nfor the other in exactly the same way. Be ready to experiment with your\nideas.Instrumented leadership to gather progress metrics, gauge general direction of the team while keeping away from micromanagement.\nA team is a living organism that provides very informative insights\ninto its own functioning. Get into the habit of collecting valuable\ninformation about the team’s performance on areas that you feel are\nimportant. It could be simple metrics like how often has a sub-task\nshared by 2 or more people from the team been done as per your\nexpectations and how often has it suffered because of the task\nassignment, composition of the team, etc. Measurement is important\nbecause everyone would have their unique way of handling a challenge,\nwhat works for one might not work for the other and a thorough\nexamination and validation by means of statistical analysis can refine\nthe task assignment process. You could capture, for example, the nature\nof task, members involved, task completion details, number of conflicts\narising during the task (asking team members to submit a work-log entry\nwith fields like “Was the day productive? (Yes/No/Partially)”, etc. can\nprovide some initial sparks for the larger task of gathering team\nperformance related metrics (more on this in a later post).Clear roadblocks and point out future blocks and bottlenecks based on experience and inspection of gathered team metrics.\nThe metrics that you have been capturing would certainly provide some\nsense of direction - Are tasks getting closed as per expectations of\ntimelines and quality? Do team members feel more enthusiastic to work\nwith a certain set of employees than the others? What can be said about\nfavored tasks and favored team members? - The more observant you are,\nthe better the chances of finding the sweet spot of maximum efficiency.\nRemember that as a team leader your job is to ensure that people are\nhappy in their engagement with you and the team. While nothing\nreplaces a keen watch on the efforts that the team has been putting,\nnever get into the habit of micro-management. Treat your teammates the\nway prison inmates are treated at your own risk. Think of this as an\nopportunity to find out more about the people you work with - be\ngenuinely interested in their personal and professional growth. Make\nthe team feel that they are responsible to a great extent not just for\nproviding manpower and skill sets but even for the direction that the\nproduct takes over the course of time. Ownership is always an\nillusion in a professional setup. That being said, the best way to\ndefine ownership I believe is to have a person responsible for the\nsetbacks and celebrations resulting from their actions and efforts.\nSince both “setback” and “celebration” are more or less just social\nconstructs with the central idea that making incremental increase in the\nreputation one holds in the society would result in direct or indirect\nbenefits one gets and increase the chances of a ‘better life’, these can play a very important part in promoting ownership of the project that the team is working on.Take\nmeasures to limit the fear of failure on an individual level. People\nare more creative when their heads are not always on the line.\nCreativity is difficult. A number of researches point out that a\nconstant fear of failure can harm creative thinking in the long run. It\nmight be a good idea to push for better results but, find ways for\nsaying it in such a way that the team feels a need to succeed rather\nthan a need to not fail. A lot of bad things happen when we fail and our\nmind is wired to focus on those more than the things that go relatively\nwell. Assuring your team of a reasonable and unbiased assessment in\ncase of failure and getting them excited about winning can make a big\ndifference.Assume the position of accountability so that the rest of the team has lesser pressure to deal with.\nIt is important that the team feels protected from outside pressures\nand has faith in your capabilities to rescue them when the tides are\ngoing against them. No one respects a leader who runs away from a\nbattle.</p>","fields":{"tagSlugs":["/tags/leadership/","/tags/corporate/","/tags/team/","/tags/worklife/","/tags/leader/"]},"frontmatter":{"title":"Leadership Goals","tags":["leadership","corporate","team","worklife","leader"],"date":"2016-12-27T08:21:11+05:30","description":null}}},"pageContext":{"slug":"/posts/leadership-goals"}}