{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"snortingcode","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"0d77db74-dc70-5f7d-b73b-8c0cf8348d70","html":"<p>I have only recently started exploring NodeJS (I know terribly late it is!). This post can be considered a very basic introduction to NodeJS and its capabilities. And, judging from the topic of this post you should be convinced that the capabilities are massively impressive! Let’s dig in.\nNodeJS is basically a runtime (utilizing Google’s V8 VM javascript runtime) and a bunch of libraries rolled into one awesome package that you can install with a simple:\n$ apt-get install nodejs\nCaution: There is a utility called ‘node’ in debian that might interfere with your node experience (you would not be able to execute nodeJS scripts with just:\n$ node myAwesomeNodeScript.js\nif it is installed already. There is a workaround however!)\nThe apt might have an old version of nodeJS. This might help you setup your system with the latest nodeJS and npm versions!\nnpm is the all powerful node package manager which (almost astonishingly strangely) manages the nodeJS packages on your machine.\nTime for a quick test. In your favorite editor write this piece of code and save it in a file helloworld.js:\nconsole.log(“Hello World!”);\nFrom your terminal issue:\n$ node helloworld.js\nand you’ll see a brilliant shiny new “Hello World!” printed in solid gold for you on your terminal. Simple stuff. Now let’s move on to doing things that the article promised - building a web-server!\nOpen your favorite editor and type out the following lines in a file called httpServer.js and call it with node:\nvar http = require(“http”);</p>\n<p>function perRequest(request, response) {\n{% highlight javascript %}\nresponse.writeHead(200, {“Content-Type”:“text/plain”});\nresponse.write(“Hello from nodeJS!”);\n{% endhighlight %}\n}</p>\n<p>http.createServer(perRequest).listen(8000);\nconsole.log(“Server started. Listening on port 8000 …”);\nPretty much straight forward, self-explanatory piece of code. Let’s dig a little deep and see what nodeJS can and cannot do for us.\nIf you observe the above code, you’ll see that only a single instance of the server is created that is listening on the given port. On each request, the perRequest function is called but, the server does not wait for it to return in stead, it listens to other incoming requests and callback function operates behind the scenes to process each request. In a typical multi-threaded paradigm, the server would spawn a thread to handle the request, here things are different. NodeJS uses non-blocking, asynchronous I/O to process the request. \nIf you were reading between the lines, you’d know that nodeJS is perfect for a fast I/O ecosystem. Typically, consider a check-in app like Foursquare (which uses NodeJS) built on top of a horizontal scale-able back-end like MongoDB (which again is a specialist in fast reads-writes) which could be handling millions of request but each request would not require any substantial processing. NodeJS is your best bet in such a scenario! Another typical use-case of nodeJS is a chat application.\nIf the use-case requires heavy processing, stick with a more traditional multi-threaded environments like JVM or better something like Erlang.\nAll modern apps are using nodeJS extensively and it makes sense to give it a good few weeks and see what it makes of you. No silver bullet to rid you of all your worries but, nodeJS is certainly worth a serious effort. May the node be with you!</p>","fields":{"tagSlugs":["/tags/nodejs/"]},"frontmatter":{"title":"My Own Cute Little Web-Server (May The Node[JS] Be With You)","tags":["nodejs"],"date":"2014-07-05T08:25:21+05:30","description":null}}},"pageContext":{"slug":"/posts/my-own-cute-little-web-server-may-the-nodejs-be"}}