{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"7d745081-67a3-58e9-b4f8-d35f08455ed8","html":"<p>Let’s take a use-case. I bought a 22in AOC Monitor (it happens to be an Android device as well - would try to do a review of its capabilities soon). Like any other human being of the modern era, I did some research online but, didn’t find anything that could compete with the deal that my friendly local dealer offered (SP Road, Bangalore is a multi-billion dollar market believe it or not!). So, I went ahead and bought the monitor in ‘offline mode’ with no records of the purchase with any e-commerce website.\nThe Amazons of the Internet world did not see this deal happen in a direct way so they continued to push me stale offers. Every website I visit has a big banner tying to sell me a monitor! Quite obviously, things are broken!\nSomething similar happened when I bought a dress as a gift for my niece. The recommendation engine failed to see why I would not want to buy a dress every week!A typical recommendation engine works something like this:Step 1. Tap on a customer”s browsing history.\nStep 2. Try to look for ‘recommendations’ that can be suggested -     some obvious ones, some related items, some up-sells.\nThis standard approach is broken at many levels.While there are major efforts to integrate a customer’s details to create a single-view across different platforms, it remains isolated. Challenges are fair - mining massive datasets is required across a plethora of services, people often lie on social media about true choices, activities happening offline are completely ignored and many more.What can be done?Creating a multi-layered recommendation is important (I don’t have an analytics background so my terminology would be shaky, sorry). Capture the purchases, capture the things one would do with those purchases, capture events that could be a result of the purchase (A tweet - “Coffee, music and Kindle - perfect morning!” after a week long “coffee maker discounts” search history has to tell you more!).Human beings have a lot of things to tell us, one just needs the right machines listening to them!</p>","fields":{"tagSlugs":["/tags/recommendation-engine/","/tags/offer-management/"]},"frontmatter":{"title":"The Horrible Waste That Pushing Stale Offers Is!","tags":["recommendation engine","offerManagement"],"date":"2015-10-20T07:50:17+05:30","description":null}}},"pageContext":{"slug":"/undefined/"}}