{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"snortingcode","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"bd04f62f-ca9f-5e91-a339-a0e6f85b783d","html":"<p>What’s wrong with wealth accummulation?\nWell, wealth and scarcity are the ying-yang that drive/inhibit each other. In a society with more scarcity, we would have more wealth concentration. Similarly, a society with less scarcity would have more fairly distributed wealth.</p>\n<p>In the beginning …\nFor a very long time success in life was a direct function of land ownership. Class migrations were rare if not absent. An individual largely retained their social and economic status. It was fair to assume that the son of a rich land owner would inherit the “success gene” unless he did something extremely stupid. This idea that success is a familial trait was a dogma that was hard to challenge. </p>\n<p>Richer people were acknowleged to be more gifted in cognitive abilities which enabled them to gain unchallenged access to policy making. </p>\n<h1>Accummulation of privileges</h1>\n<p>When economic power concentration happens in a society it naturally creates</p>\n<p>Examples:</p>\n<ul>\n<li>Healthcare</li>\n<li>Education ()</li>\n<li>Vehicles on the road</li>\n<li>Real estate</li>\n</ul>\n<p>When a traveller has to shell out more money from their savings for a flight ticket due to unavailability of cheaper tickets in a public transport like train, it is not wise to see that as an indicator of class elevation for that individual or of higher standard of living. When, in fact, it is a <strong>higher cost of living</strong> which steals opportunities from the individual. </p>\n<p>The economic divide and the accummulation of basic resources reserved for the rich creates an uncomfortable struggle for the ones on the other side of the divide as they find themselves stuck between a rock and a hard place. Paying a much bigger percentage of their income for basic necessities widens the already alarming economic divide. </p>\n<h1>Solutions</h1>\n<p>I happened to ask a communist college leader about what he thought was the solution to the problem of wealth accummulation. <strong>“Kill the rich!”</strong> he said without a moment’s hesitation. Youth has energy but is also riddled with recklessness. Let me walk you through the reasons why this thought/approach is a ridiculous idea. </p>\n<p>To begin with, where would we draw the line? It is hard to believe that determination of an individual’s strata would be done purely on the basis of class or accummulated wealth. The individual’s political kinship and proximity to those in power would drive the decision for determination which would render the whole exercise useless.</p>\n<p>Even if we did manaage to establish a regime that is ruthlessly honest, one must draw a line somewhere. This imaginary class division line would be at best arbitrary or hugely misinformed.</p>\n<p>The second impracticality with the “Kill the rich!” rhetoric is its inability to provide a sustainable solution. Pruning human population based on random calculations done by those in power is not just </p>","fields":{"tagSlugs":["/tags/open-source/"]},"frontmatter":{"title":"What Is The Cost Of Wealth Accummulation?","tags":["open source"],"date":"2019-02-27T17:46:37.121Z","description":"Did you know that there are great Open Source alternatives for almost every service you use on the Internet? Should you be using them?"}}},"pageContext":{"slug":"/posts/cost-of-wealth-accummulation/"}}