{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"snortingcode","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"92dfb1af-d7a7-50d7-9872-576cb3c8922b","html":"<p>Open Source software is the bedrock of the current technological revolution and our beloved information age. To give you an idea about the power and influence of Open Source in our lives, let me give you a few examples:</p>\n<ul>\n<li>Microsoft paid 12 billion dollors for GitHub, the most popular platform for storing Open Source code on the Internet.</li>\n<li>If you eliminated Open Source software in its entirety, you would not have any information/communication that’s operational. The whole world would break down. There is no other entity that can make such a claim.</li>\n<li>If every Open Source developer was paid $1 for every piece of code that they check in ($1 per commit) and that money was given away, we would end poverty in the world!</li>\n</ul>\n<p>I can’t wait to see the day when <strong>Open Source software for governance</strong> would become an election winning agenda in a powerful country of the world. Open Source governance software framework could completely change the way nations are thought about and governed. The idea of the Government as the most powerful goon, that has never been contested even in a (mostly) functional democracy, could be replaced by a Government that would not just have <em>transparancy</em> as a goal but, as a fundamental truth. </p>\n<p>While the governments of the world take their time to come to terms with the power of Open Source, here are some alternatives for your everyday Internet shananigans from the world of Open Source (or as you would discover for youself soon - the world of freedom and beauty):</p>\n<blockquote>\n<p>Replace</p>\n</blockquote>\n<p><strong>Gmail/Yahoo</strong> by (<strong>Disroot</strong>)[https://disroot.org]\n<strong>FaceBook</strong> by <strong>Diaspora</strong>[https://diasporafoundation.org/]\n<strong>Twitter</strong> by <strong>Mastodon</strong>[https://joinmastodon.org/]\n<strong>Skype</strong> by <strong>Jitsi Meet</strong>[https://jitsi.org/jitsi-meet/]\n<strong>Whatsapp</strong> by <strong>Signal</strong>[https://signal.org/]</p>\n<p>All these come with pretty much the same functionality as their blood sucking cousin but, they give you uncompromisable privacy, absolute control over your own data, </p>","fields":{"tagSlugs":["/tags/open-source/"]},"frontmatter":{"title":"Open Source For Everyone","tags":["open source"],"date":"2019-02-25T17:46:37.121Z","description":"Is Climate Change really such a big threat? Don't we have some MIT genius who has this already figured out?"}}},"pageContext":{"slug":"/posts/open-source-alternatives-for-everyone/"}}