{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"c9d53877-a1ab-5d4d-a3ef-e68f4fddd27c","html":"<p>If you visit Prague and decide to explore the city during the day, your attention would swing back and forth between the beautiful people on the streets and the beautiful monuments and statues that dot the entirety of that enchanting city.</p>\n<p>The alloy statues all across the city have a curious property - they all have glistening privates! As bizarre as this sounds, it takes only a moment to understand why. Visitors to the city, over the years, have consistently placed their hands on the genitalia of these structures, rendering those parts gleamingly distinguishable from the rest of the structure.</p>\n<p>This certainly adds a character to the original structures that imparts quite a unique interaction quality to them. I think we can safely assume that this interaction with the art was not “by design” yet, it emerged as a very powerful feature that increases the efficacy of the structure if we assume that its function is to engage visitors!</p>\n<p>Such serendipitous interactions are miraculous. If you are in the business of designing interactions for your customers, these are the holy grail of design to an extent. The question of interest then, would be to see if such interactions can be conceived in advance, implemented with foresight and tested before the actual rollout.</p>\n<p>There’s a great biologist from the early 20th century, D’Arcy Thompson, who devoted considerable energy into exploring such “causes”. Especially, the synergy that exists between <em>“final cause”</em> and <em>“physical cause”</em>. Final cause is the cause based on purpose - a wheel has a round shape by design because other shapes would make locomotion impractical. Physical cause is the inherent nature/feature of the object under consideration - a pebble has a smooth surface because its edges have been chipped away by corrosion over several years.</p>\n<p>I think good design is all about finding a natural synergy between the final cause and the physical cause. This is true for all disciplines; anywhere design considerations are important. The most obvious would be interaction design. The interaction designer who gets my money would be able to find that synergy between a desired interaction of the end-user with the product and the mechanical structure of the product - various moving parts, etc. An example that would be easier to understand would be designing an algorithm that has mechanical sympathy - something as simple as having bigger block sizes in a file system that crunches BigData.</p>\n<p>I wish I could offer a formula that could be applied to different situations. I have none. However, design thought can transcend formulae to an extent. Think of it as a NP-Complete problem that is hard to find the solution to but, once you guess a good solution, it is easy to test things out!</p>","fields":{"tagSlugs":["/tags/design/","/tags/form/","/tags/function/","/tags/art/"]},"frontmatter":{"title":"Design Harmony","tags":["design","form","function","art"],"date":"2018-05-09T23:41:30+05:30","description":null}}},"pageContext":{"slug":"/posts/design-harmony"}}