{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"snortingcode","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"6028ff10-47d9-5af1-ba30-d2c1074e072c","html":"<p>Recently, a friend has joined the startup wagon armed with a brilliant idea, execution capabilities and potential capital in angel investment money. I was sharing my own experiences with him and could trace out a few that might be worth a 10 minute read for anyone trying to be more productive - something that the act of starting a company certainly requires.I’ll just put them here in no particular order. Would love to see what you think, what your own experiences have been like.Work as a company not a personWhen you decide to start something tiny with the idea of making it big one day it is easy to still operate in the individual scheme of things. To see yourself (or a few other friends) as a company can be quite a challenge but, it is important that you define those boundaries for your time, resources and expenses. This would help you keep a track of things you are doing that align you more with the future that you visualize. It also helps by giving you a head start in figuring out what works for you as an organization and what does not.Take designated holidaysHolidays are not just a matter of HR policy, they are required by you to unwind and eventually be more productive. When you define on which days you can drink for long hours with your friends, on which days you can visit your parents, the days you can go on a boat ride, you’ll find that your ‘working’ days are more productive and there are lesser incentives for you to not give your 100% on the days that you are working. Document everything you do, say, think, talk about your projectOur minds are capable of painting very vivid, entertaining pictures of our ideas for us. Sadly, it is impossible to translate those ideas into tangible artifacts without a great deal of loss of details. The best we can do is make sure we describe our ideas and thoughts in the best possible way and keep doing that till our documentation reaches a maturity that we are satisfied with. Your ideas should be captured in such detail that if one decides to go though them they get a picture as close to what you have in mind as possible. There are caveats to this approach as well - it is possible to get stuck in a documentation quicksand. More details on effective documentation on some other day but, here’s a quick one - Don’t document thoughts as they come, you’ll throttle the flow by the\nprocess of writing. Keep thinking about them and take a break after a\nfew hours before you write them down.Work with a traceability matrix in your documentAlmost everything you want to do would have a target audience and some expected effects that you want to bring about with your idea. So there would be a (measurable) effect that your implementation should bring about. In the frenzy of getting things done fast, it is easy to lose that focus. A simple act of making sure you trace each implementation detail to a point where you don’t lose focus is very important.Don’t overwork - It gives you reasons to take days offWhile working hard is important, what’s more critical is having a routine. If you work very hard, you would need to compensate by taking longer non-working breaks. These breaks do more harm than a regular routine that includes the visit to the badminton courts, a drink with your buddies and a Sunday morning run.HealthHopefully, I don’t need to convince you about this one. Health is important! Find an activity that you like to do and do it regularly.</p>","fields":{"tagSlugs":["/tags/startup/","/tags/productivity/"]},"frontmatter":{"title":"Lessons learned from a failed ‘pre-startup’","tags":["startup","productivity"],"date":"2017-12-07T02:19:15+05:30","description":null}}},"pageContext":{"slug":"/posts/lessons-learned-from-a-failed-pre-startup"}}