{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"e4467592-880e-59c1-affb-49b54d640ce3","html":"<p>The point we’re all missing with the Facebook data leaks and no one really wants to talk about is something that invalidates Facebook’s source of income and your purpose on this “social networking” website!If Facebook is a platform for “friends” why are the political parties, big corporations, businesses even on it? A platform for friends is bound to be personal. One would expect it to have access to some very intimate details that can be used in any form of manipulation if one intends to do that. A Trump election campaign is not my “friend”. I might really be expecting Narendra Modi to change India into a country that has gold plated roads and convert each citizen into a swatch Bharat candidate whose fart smells of raspberries but, Modi is not my “friend”.</p>\n<p>These organisations have one agenda when they join Facebook - mass manipulation! If we express shock at the ways in which they’ve abused Facebook’s loosely defined data protection policies, we are merely engaging in self-deception. This platform is doing exactly what it is meant to do - provide access to your personal information to agencies that intend to use it to manufacture consent. Each new feature that’s added to the platform has just one function - increase user engagement to the point that you are so addicted that you take stupid decisions. I thought it was quite clear that this “free” platform was a trap. Honestly, I’m just surprised that people thought otherwise. If you “Like” a page titled “Trump for President”, you are engaging in active propaganda. Compare any of your friends’ Facebook posts with that of your favourite politician - does it ever look like you are looking at the daily activities of another human being? Do they even ever poop?! Or have sex, get drunk, have a crapy hangover, sound stupid and express gratitude when you correct them?These are NOT YOUR FRIENDS! When you sign up to follow these personalities and corporations, you are signing a consent form to be ready to be manipulated! So, take responsibility for your stupidity and move on!</p>","fields":{"tagSlugs":["/tags/facebook/","/tags/data-protection/","/tags/manipulation/","/tags/consent-manufacturing/"]},"frontmatter":{"title":"Upset About Facebook’s Data Scandal? Move on!","tags":["facebook","data protection","manipulation","consent manufacturing"],"date":"2018-03-26T23:41:30+05:30","description":null}}},"pageContext":{"slug":"/undefined/"}}