{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"ea251984-8852-5c3c-adfe-dc596a06fc54","html":"<p>If popular estimates are to be believed, the automation/robotics would make human beings (a majority of us!) unemployable in the next two decades. The question is not of ‘if’ anymore, it is an eventuality. While we must prepare for a situation like this, there is not much an individual can do. The preparation has to be a well orchestrated group effort involving governments, activists and organizations. Let’s first understand why individual effort would not be quite enough. While a few of us would be able to work hard enough, smart enough and be lucky enough to reach the place at the top of the ladder and steer clear from the automation ‘de-humanization’ in various work spaces, the competition would be crushing! You might as well prepare to be a celebrity, because just writing beautiful code or being a perfect tutor might not be enough - there would be millions more exactly like you competing for very very few spots!This is not going to be like the industrialization age where learning a new skill would help you save your job or proceed to a better one! The jobs won’t exists. Simple. It is tough if not impossible to prepare for a scenario like that!We’ve talked about this before! Let’s talk about what’s happening to mitigate the situation (at least for as many individuals as possible).There’s a movement, “Basic Income”, that aims to do a (minor) redistribution of wealth by making money available to individuals without expecting things in return. You provide money not because these individuals would give you (or someone else) anything in return, you provide them ‘basic’ income to take care of themselves. The interesting thing about this social movement is that it is not a government initiative. A bunch of people have come together, identified the problem that is about to hit us in future and have started constructing a plausible solution. Far from being perfect, I believe this movement would undergo several iterations. But, this is nevertheless a very good start.How does all this impact the social structure of the regions would be interesting to see (I can hardly wait to crawl inside a time-capsule and check out the exciting things that would change as a result). The basic needs would be provided by the governments of even under-developed societies - food, shelter. But, the idea of what are basic needs would also undergo a major change in the coming years. Even today access to Internet is considered a basic right (Facebook’s sham of a Internet.org aside, information access is of fundamental importance).An important argument to consider is that ‘greed’ is embedded in human nature. Consider this, the male counterpart is required to improve the gene pool. If there was no competition for the female, evolution would not be able to curtail the bad genes. That’s the place ‘want’ for a better wife, house, car, etc. emerges out of? Would the society, then, be ‘content’ with a ‘basic income’? I guess we would not know. Even if we do get a digital answer for this question, the politics of the world (and of our everyday lives) would not let us say it out loud and we’d keep trying to design better policies, formulate a modified socialist idea knowing all too well that they are doomed to fail.There’s also a brighter side (there must be many, I hope). An industry that would considerably benefit from the ‘de-humanization’ age would be the recruitment industry. Consider a situation where there were only a few people having a particular skill-set in a region. The companies looking for candidates would not have to approach any recruitment agency for that situation, they would reach out to the candidates directly (given they are not hiding under a rock while possessing market desirable skills!). They come into the picture when there are many people with desired skills hidden within a much greater pool. Each of them as good as the other, and several many promising to be better than them!We are entering an exciting era!</p>","fields":{"tagSlugs":["/tags/humans-need-not-apply/","/tags/automation/","/tags/de-humanization/","/tags/basic-income/"]},"frontmatter":{"title":"De-Humanization!","tags":["humans need not apply","automation","de-humanization","basic income"],"date":"2015-05-21T00:06:51+05:30","description":null}}},"pageContext":{"slug":"/undefined/"}}