{"data":{"site":{"siteMetadata":{"title":"Snorting Code, Et al.","subtitle":"I don't take myself too seriously!","copyright":"© All rights reserved.","author":{"name":"Prasoon","twitter":"prasoonj"},"disqusShortname":"","url":"https://prasoonj.github.io/snortingcode"}},"markdownRemark":{"id":"78570fea-1522-5b0f-909d-b8eae7d91ed2","html":"<p>Every web designer wants the end-users to be able to work their way around with ease on the platform that they have designed for them. That IS the primary goal of any interaction designer. Every other thing is a by product of providing that ease to the user - more sales, less support, more time with your boyfriend, etc.\nIt infuriates me when the the project stakeholders address the end-users as ‘dumb users’ while demonstrating why a certain design might not work out. The intelligence level of the user is no excuse for bad UX! The smartest of users would get lost in the jungle of bad user experience and the most naive user would be able to navigate with ease on a well designed and thought about website/app.\nThere are several guidelines and instruction manuals for creating that perfect UX (and you should read at least a few of them if you have any business with developing a website). Here’s my humble list of things that can, if nothing more, initiate a discussion on designing a UX that looks at intuitive and functional ways of providing a solution:\nIf you are simulating a process that exists in the real world (for example, an app that helps bring the processes involved in a government office onto the web), try to stay as close to the way the process is handled in the physical world as possible. There is nothing more painful than asking the end-user to change the way they’ve got used to doing a certain work. The app that you build should help them do what they already do much faster and in a less error prone way.\nForget point #1 above if you can bring a major improvement in the process in terms of time taken, infrastructure required or money spent! If the new process is an improvement, which was only possible due to the inclusion of technology, the time to learn to do things differently would be a trade-off that your customers would be happy with.\nUse standard procedures as much as possible. If there is a need for a logout button, for instance, it must be placed at the top-right hand corner of the page. Why? Because everyone else does the same. When a user wants to logout that’s where she moves the cursor. These small factors can all give a major boost towards reducing the learning curve for the user when added up together.\nIf it is possible to shrink the target audience (reasonably), do that. If making your target audience smaller and more specific adds to improving the UX in a major way, that’s what you should be doing. For example, if your website caters to people who design circuit boards, give them icons that resemble the physical object as closely as possible. Innovation where it kills familiarity is a no-no.\nDisclaimer: I’m not an interaction designer. I’ve worked on many web-applications however and have used several others and have seen the pain areas and beautiful implementations and, hence this article. Please feel free to add to it or correct me if I’m wrong.</p>","fields":{"tagSlugs":["/tags/ux/","/tags/ui/"]},"frontmatter":{"title":"Dumb Users vs Bad UX!","tags":["ux","ui"],"date":"2014-08-26T03:22:29+05:30","description":null}}},"pageContext":{"slug":"/undefined/"}}